# Day Objectivies
## Date: 30-10-2019
### Pandas

In [ ]:
# pandas:-> pandas stands for "python data analysis library".
# uses:-
#  1.It is a open source library.
#  2.It is used for data manipulations and analysis.
# It deals with two different data structures.
#   1.series ->It is used to store the data in 1-d Array.
#   2.DataFrame -> It is used to store the data in 2-d Array.

In [2]:
import pandas as pd
data=[10,20,30]
res=pd.Series(data)
print(res)

0    10
1    20
2    30
dtype: int64

In [3]:
data={'s1':10,'s2':20}
res=pd.Series(data)
print(res)

s1    10
s2    20
dtype: int64

In [6]:
data={'rollnumber':[510,520,530],'name':['narmada','mani','ramya'],'marks':[50,60,100]}
df=pd.DataFrame(data)
print(df)

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100

In [7]:
# To get column names using 'columns'
df.columns

Index(['rollnumber', 'name', 'marks'], dtype='object')

In [8]:
# To get only values from the Dataframes using 'values'
df.values

array([[510, 'narmada', 50],
       [520, 'mani', 60],
       [530, 'ramya', 100]], dtype=object)

In [9]:
# To access only specific column name
df['name']

0    narmada
1       mani
2      ramya
Name: name, dtype: object

In [11]:
df.values[2][2]

100

In [12]:
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100

In [13]:
df.values[1,1]

'mani'

In [14]:
# To add newrow
df.loc[3]=[540,'apssdc',45]
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100
3         540   apssdc     45

In [17]:
df=df.drop(2)

In [18]:
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
3         540   apssdc     45

In [31]:
# function to create a read data from csv file
def read_Csvdata(filepath):
    df=pd.read_csv(filepath)
    return df
read_Csvdata('studentdata.csv')

      name  rollnumber  marks
0  narmada         510     56
1   apssdc         520     45
2      sai         533     60
3  lavanya         540     70

In [33]:
res=read_Csvdata('studentdata.csv')

In [22]:
for i in df.values:
    print(i)

[510 'narmada' 50]
[520 'mani' 60]
[540 'apssdc' 45]

In [40]:
def get_row_index(filepath,rowkey):
#     df=pd.read_csv('studentdata.csv')
    for i in range(len(res.values)):
        if res.values[i][0]==rowkey or res.values[i][1]==rowkey:
            row_index=i
    return row_index
get_row_index('studentdata.csv','narmada')

ValueError: The truth value of an array with more than one element is ambiguous. Use a.any() or a.all()

In [39]:
def get_column_index(filepath,colkey):
    for i in range(len(res.columns)):
        if res.columns[i]==colkey:
            col_index=i
    return col_index
get_column_index('studentdata.csv','marks')

2